# Exercise

### - Read the File

In [1]:
#Pedro Alejandro Uicab DIaz Data3-A
import numpy as np
import pandas as pd
#File Reading
c_df=pd.read_csv('individuos.csv')
print(c_df.head(5))

  individuo    origen  peso  tamano
0     cam01  Alemania    18    26.0
1     cam02  Alemania    38    62.0
2     cam03  Alemania    39    59.5
3     cam04  Alemania    28    41.0
4     cam05  Alemania     7    13.5

In [2]:
#Read Headers
print(c_df.columns)

Index(['individuo', 'origen', 'peso', 'tamano'], dtype='object')

In [3]:
#Read each column - Individuo
print(c_df['individuo'][:5])

0    cam01
1    cam02
2    cam03
3    cam04
4    cam05
Name: individuo, dtype: object

In [4]:
#Read each column - Origen
print(c_df['origen'][:5])

0    Alemania
1    Alemania
2    Alemania
3    Alemania
4    Alemania
Name: origen, dtype: object

In [5]:
#Read each column - Peso
print(c_df['peso'][:5])

0    18
1    38
2    39
3    28
4     7
Name: peso, dtype: int64

In [6]:
#Read each column - Tamaño
print(c_df['tamano'][:5])

0    26.0
1    62.0
2    59.5
3    41.0
4    13.5
Name: tamano, dtype: float64

In [7]:
#Read Each Row or Rows
print(c_df.iloc[:5])

  individuo    origen  peso  tamano
0     cam01  Alemania    18    26.0
1     cam02  Alemania    38    62.0
2     cam03  Alemania    39    59.5
3     cam04  Alemania    28    41.0
4     cam05  Alemania     7    13.5

In [8]:
#Read Each Row -Comparation-
print(c_df.iloc[:4])

  individuo    origen  peso  tamano
0     cam01  Alemania    18    26.0
1     cam02  Alemania    38    62.0
2     cam03  Alemania    39    59.5
3     cam04  Alemania    28    41.0

In [9]:
#Read a Specific Location (Alemania)
print(c_df.iloc[0,1])

Alemania

In [10]:
#Read a Another Specific Location (39)
print(c_df.iloc[2,2])

39

# Exercise

### - Find the weight of the second individuo, cam01, tur03 and pet05

In [11]:
#Second individuo weight=38
c_df.loc[c_df['individuo']=='cam02']

  individuo    origen  peso  tamano
1     cam02  Alemania    38    62.0

In [12]:
#If we know the position we can code it in this way
c_df.loc[1:1]

  individuo    origen  peso  tamano
1     cam02  Alemania    38    62.0

In [13]:
#Cam01 weight=18
c_df.loc[:0]

  individuo    origen  peso  tamano
0     cam01  Alemania    18    26.0

In [14]:
#tur03 weight=32
c_df.loc[c_df['individuo']=='tur03']

   individuo      origen  peso  tamano
12     tur03  Inglaterra    32    49.0

In [15]:
#pert05 weight=19
c_df.loc[c_df['individuo']=='pet05']

   individuo  origen  peso  tamano
19     pet05  Italia    19    28.5

In [16]:
#Describing Data (peso and tamaño)
c_df.describe()

            peso     tamano
count  32.000000  32.000000
mean   21.906250  32.765625
std    10.650941  15.879071
min     5.000000  11.000000
25%    14.500000  18.625000
50%    20.500000  28.750000
75%    29.500000  44.250000
max    40.000000  62.000000

In [17]:
#We can obtain essential info about our df
c_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32 entries, 0 to 31
Data columns (total 4 columns):
individuo    32 non-null object
origen       32 non-null object
peso         32 non-null int64
tamano       32 non-null float64
dtypes: float64(1), int64(1), object(2)
memory usage: 1.1+ KB

In [18]:
#We can also use this function to know the data type or our data/header
c_df.dtypes

individuo     object
origen        object
peso           int64
tamano       float64
dtype: object

In [19]:
#Filtering Data is a very useful tool to search data
c_df.loc[c_df['individuo'].str.contains('tur')]

   individuo      origen  peso  tamano
10     tur01  Inglaterra    26    39.0
11     tur02  Inglaterra    17    21.5
12     tur03  Inglaterra    32    49.0
13     tur04  Inglaterra    21    31.5
14     tur05  Inglaterra    21    27.5
25     tur06     Francia    33    49.5
26     tur07     Francia    31    43.5
27     tur08     Francia     9    15.5
28     tur09     Francia    10    17.0
29     tur10     Francia     5    11.5
30     tur11     Francia    20    26.0
31     tur12     Francia    27    43.5

# Exercise

### - Maximum size and weight recorded

In [20]:
# Maximum Size recorded
c_df['tamano'].max()

62.0

In [21]:
# Maximum Weight recorded
c_df['peso'].max()

40

In [22]:
# In this case we can use another useful tool -sorting values-
# If we pass two numerical values so the first one is (ascending=False)
c_df.sort_values(['tamano','peso'], ascending=[0,0])

   individuo      origen  peso  tamano
1      cam02    Alemania    38    62.0
2      cam03    Alemania    39    59.5
8      cam09    Alemania    40    59.0
23     pet09      Italia    36    54.0
24     pet10     Francia    39    53.5
25     tur06     Francia    33    49.5
12     tur03  Inglaterra    32    49.0
5      cam06    Alemania    29    46.5
26     tur07     Francia    31    43.5
31     tur12     Francia    27    43.5
3      cam04    Alemania    28    41.0
7      cam08    Alemania    25    40.5
17     pet03      Italia    28    40.0
10     tur01  Inglaterra    26    39.0
13     tur04  Inglaterra    21    31.5
21     pet07      Italia    16    29.0
19     pet05      Italia    19    28.5
14     tur05  Inglaterra    21    27.5
30     tur11     Francia    20    26.0
0      cam01    Alemania    18    26.0
6      cam07    Alemania    19    25.5
11     tur02  Inglaterra    17    21.5
22     pet08      Italia    15    20.5
9      cam10    Alemania    16    19.0
20     pet06      Italia    13    17.5
28     tur09     Francia    10    17.0
27     tur08     Francia     9    15.5
18     pet04      Italia    10    15.0
4      cam05    Alemania     7    13.5
16     pet02      Italia     8    12.0
29     tur10     Francia     5    11.5
15     pet01  Inglaterra     6    11.0

# Exercise

### - Means of individuos for each origin

In [27]:
#Setting origen to calculate means
c_df.set_index(['origen'])

           individuo  peso  tamano
origen
Alemania       cam01    18    26.0
Alemania       cam02    38    62.0
Alemania       cam03    39    59.5
Alemania       cam04    28    41.0
Alemania       cam05     7    13.5
Alemania       cam06    29    46.5
Alemania       cam07    19    25.5
Alemania       cam08    25    40.5
Alemania       cam09    40    59.0
Alemania       cam10    16    19.0
Inglaterra     tur01    26    39.0
Inglaterra     tur02    17    21.5
Inglaterra     tur03    32    49.0
Inglaterra     tur04    21    31.5
Inglaterra     tur05    21    27.5
Inglaterra     pet01     6    11.0
Italia         pet02     8    12.0
Italia         pet03    28    40.0
Italia         pet04    10    15.0
Italia         pet05    19    28.5
Italia         pet06    13    17.5
Italia         pet07    16    29.0
Italia         pet08    15    20.5
Italia         pet09    36    54.0
Francia        pet10    39    53.5
Francia        tur06    33    49.5
Francia        tur07    31    43.5
Francia        tur08     9    15.5
Francia        tur09    10    17.0
Francia        tur10     5    11.5
Francia        tur11    20    26.0
Francia        tur12    27    43.5

In [28]:
#Then, we just use mean function to do the operation 
means=c_df.groupby("origen").mean()

In [29]:
# Result
means.head()

              peso     tamano
origen
Alemania    25.900  39.250000
Francia     21.750  32.500000
Inglaterra  20.500  29.916667
Italia      18.125  27.062500

# Exercise 

### - Are there some Correlation among weight and size values?

In [31]:
#Correlation
c_df.corr()

            peso    tamano
peso    1.000000  0.984333
tamano  0.984333  1.000000

.98 so, there is exist !

# Exercise 

### - Save the England data into new file .csv

In [33]:
#Exporting data to CSV
c_df.loc[c_df['origen']=='Inglaterra'].to_csv("Inglaterra.csv")

In [36]:
England_df=pd.read_csv('Inglaterra.csv')
print(England_df)

   Unnamed: 0 individuo      origen  peso  tamano
0          10     tur01  Inglaterra    26    39.0
1          11     tur02  Inglaterra    17    21.5
2          12     tur03  Inglaterra    32    49.0
3          13     tur04  Inglaterra    21    31.5
4          14     tur05  Inglaterra    21    27.5
5          15     pet01  Inglaterra     6    11.0

In [37]:
England_df

   Unnamed: 0 individuo      origen  peso  tamano
0          10     tur01  Inglaterra    26    39.0
1          11     tur02  Inglaterra    17    21.5
2          12     tur03  Inglaterra    32    49.0
3          13     tur04  Inglaterra    21    31.5
4          14     tur05  Inglaterra    21    27.5
5          15     pet01  Inglaterra     6    11.0

### Practice done by Pedro A. Uicab DIaz